edvardmunch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="no" xml:lang="no">
<head>
<!-- 2018-07-31 tir. 20:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programmering og modellering X ved Edvard Munch</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tarjei Bærland" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css">
<link href='https://fonts.googleapis.com/css?family=Open Sans' rel='stylesheet'>
<link href='https://fonts.googleapis.com/css?family=Source Code Pro' rel='stylesheet'>


</head>
<body>
<div id="content">
<h1 class="title">Programmering og modellering X ved Edvard Munch</h1>
<div id="table-of-contents">
<h2>Innhold</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org437da6e">Mine mål</a></li>
<li><a href="#org6446be9">Mine forventninger</a></li>
<li><a href="#orgcf01ab5">Datoer</a></li>
<li><a href="#org18ebf19">Forutsetninger</a></li>
<li><a href="#org1cd657e">Arbeid</a></li>
</ul>
</div>
</div>
<p>
Følgende er en gjennomgang av mine, Tarjeis, forventninger til dere, elevene, gjennom faget Programmering og modellering X.
</p>

<div id="outline-container-org437da6e" class="outline-2">
<h2 id="org437da6e">Mine mål</h2>
<div class="outline-text-2" id="text-org437da6e">
<p>
I løpet av dette faget er mitt mål at dere skal
</p>
<ul class="org-ul">
<li>erverve grunnleggende programmeringsferdigheter;</li>
<li>lære problemløsningsstrategier for realfagsproblemer;</li>
</ul>
</div>
</div>

<div id="outline-container-org6446be9" class="outline-2">
<h2 id="org6446be9">Mine forventninger</h2>
</div>

<div id="outline-container-orgcf01ab5" class="outline-2">
<h2 id="orgcf01ab5">Datoer</h2>
<div class="outline-text-2" id="text-orgcf01ab5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Uke</th>
<th scope="col" class="org-left">Opplegg</th>
<th scope="col" class="org-left">Hjemme</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org18ebf19" class="outline-2">
<h2 id="org18ebf19">Forutsetninger</h2>
<div class="outline-text-2" id="text-org18ebf19">
<p>
Dette faget baseres på Matematikk 1T. Det er <i>ikke</i> egnet å ta faget ved siden av andre matematikkfag enn R1 og R2, dette er ikke et generelt programmeringsfag, men et realfagsrettet.
</p>
</div>
</div>

<div id="outline-container-org1cd657e" class="outline-2">
<h2 id="org1cd657e">Arbeid</h2>
<div class="outline-text-2" id="text-org1cd657e">
</div>
<div id="outline-container-orgbc0c2e9" class="outline-3">
<h3 id="orgbc0c2e9">På skolen</h3>
<div class="outline-text-3" id="text-orgbc0c2e9">
<p>
I all hovedsak vil tiden vi har sammen på skolen bli brukt til problemløsing av forskjellige oppgaver og caser.
</p>
</div>
</div>

<div id="outline-container-org41c87a6" class="outline-3">
<h3 id="org41c87a6">Hjemme</h3>
<div class="outline-text-3" id="text-org41c87a6">
<p>
<i>Før</i> skoleøkta hver uke, kreves det at dere har <i>prøvd</i> hjemmearbeidet fra hjemme-kolonna i tabellen over.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
